In [44]:
import pandas as pd #now we have imported pandas
df=pd.read_csv('dirty_cafe_sales.csv') #df has our dataset now let's print it to see how it looks like
df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11
...,...,...,...,...,...,...,...,...
9995,TXN_7672686,Coffee,2,2.0,4.0,NaN,UNKNOWN,2023-08-30
9996,TXN_9659401,NaN,3,NaN,3.0,Digital Wallet,NaN,2023-06-02
9997,TXN_5255387,Coffee,4,2.0,8.0,Digital Wallet,NaN,2023-03-02
9998,TXN_7695629,Cookie,3,NaN,3.0,Digital Wallet,NaN,2023-12-02
9999,TXN_6170729,Sandwich,3,4.0,12.0,Cash,In-store,2023-11-07

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [46]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_1961373,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [47]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_1961373,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [48]:
#let's make a price dict
item_price = {
    'Coffee':2.0,
    'Tea':1.5,
    'Sandwich':4.0,
    'Salad':3.0,
    'Cake':3.0,
    'Cookie':1.0,
    'Smoothie':4.0,
    'Juice':3.0
}

# Reverse mapping (price to item)
price_item = {price: item for item, price in item_price.items()}

# Filling missing 'item' values based on 'Price per Unit'
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))

df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_1961373,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [49]:
try:
    df['Price Per Unit'] = df['Price Per Unit'].astype(float)
except Exception as e:
    print(e)
    pass

could not convert string to float: 'ERROR'

In [50]:
import numpy as np
df['Price Per Unit'] = df['Price Per Unit'].replace(['ERROR','UNKNOWN'], np.nan)
df['Price Per Unit'] = df['Price Per Unit'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9467 non-null   float64
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(1), object(7)
memory usage: 625.1+ KB

In [51]:
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9939 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9467 non-null   float64
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(1), object(7)
memory usage: 625.1+ KB

In [52]:
df['Total Spent'] = df['Total Spent'].replace(['ERROR','UNKNOWN'], np.nan)
df['Total Spent'] = df['Total Spent'].astype(float)

In [53]:
df['Quantity'] = df['Quantity'].replace(['ERROR','UNKNOWN'], np.nan)
df['Quantity'] = df['Quantity'].astype(float)

In [54]:
# Filling the null values in column Price Per Unit
df['Price Per Unit'] = df['Price Per Unit'].fillna(df['Total Spent']/df['Quantity'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9939 non-null   object
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9962 non-null   float64
 4   Total Spent       9498 non-null   float64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

In [55]:
# Fill Item Columns
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9960 non-null   object
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9962 non-null   float64
 4   Total Spent       9498 non-null   float64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

In [56]:
# WE still have missing items and since we can't possible determine 
#what are these items we are going to drop them

df.dropna(subset=['Item'], inplace = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9960 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9960 non-null   object
 1   Item              9960 non-null   object
 2   Quantity          9484 non-null   float64
 3   Price Per Unit    9924 non-null   float64
 4   Total Spent       9460 non-null   float64
 5   Payment Method    7391 non-null   object
 6   Location          6712 non-null   object
 7   Transaction Date  9801 non-null   object
dtypes: float64(3), object(5)
memory usage: 700.3+ KB

In [57]:
# We are going to removethe missing / null values from Transaction Date
df.dropna(subset = ['Transaction Date'], inplace = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9801 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9801 non-null   object
 1   Item              9801 non-null   object
 2   Quantity          9334 non-null   float64
 3   Price Per Unit    9767 non-null   float64
 4   Total Spent       9310 non-null   float64
 5   Payment Method    7280 non-null   object
 6   Location          6607 non-null   object
 7   Transaction Date  9801 non-null   object
dtypes: float64(3), object(5)
memory usage: 689.1+ KB

In [58]:
#We can still see some missing values in the 'Price Per Unit' column 
#we can use the same approach we used on 
#the 'Item' column but using item_price dictionary this time

df['Price Per Unit'] = df['Price Per Unit'].fillna(df['Item'].map(item_price))
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9801 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9801 non-null   object
 1   Item              9801 non-null   object
 2   Quantity          9334 non-null   float64
 3   Price Per Unit    9797 non-null   float64
 4   Total Spent       9310 non-null   float64
 5   Payment Method    7280 non-null   object
 6   Location          6607 non-null   object
 7   Transaction Date  9801 non-null   object
dtypes: float64(3), object(5)
memory usage: 689.1+ KB

In [59]:
empty_price_df = df[df['Price Per Unit'].isna()]
empty_price_df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
2289,TXN_7524977,UNKNOWN,4.0,NaN,NaN,ERROR,NaN,2023-12-09
3779,TXN_7376255,UNKNOWN,NaN,NaN,25.0,NaN,In-store,2023-05-27
4152,TXN_9646000,ERROR,2.0,NaN,NaN,NaN,In-store,2023-12-14
7597,TXN_1082717,ERROR,NaN,NaN,9.0,Digital Wallet,In-store,2023-12-13

In [60]:
df = df[~df['Item'].isin(['ERROR','UNKNOWN'])]
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9175 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9175 non-null   object
 1   Item              9175 non-null   object
 2   Quantity          8749 non-null   float64
 3   Price Per Unit    9175 non-null   float64
 4   Total Spent       8723 non-null   float64
 5   Payment Method    6819 non-null   object
 6   Location          6192 non-null   object
 7   Transaction Date  9175 non-null   object
dtypes: float64(3), object(5)
memory usage: 645.1+ KB

####The columns with null values
1. Quantity
2. Total Spent
3. Payment Method
4. Location

In [61]:
df.to_csv('dirty_sales_result_1.csv')

In [62]:
empty_price_df1 = df[df['Quantity'].isna()]
empty_price_df1

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
20,TXN_3522028,Smoothie,NaN,4.0,20.0,Cash,In-store,2023-04-04
55,TXN_5522862,Cookie,NaN,1.0,2.0,Credit Card,Takeaway,2023-03-19
57,TXN_2080895,Cake,NaN,3.0,3.0,Digital Wallet,In-store,2023-04-19
66,TXN_8501819,Juice,NaN,3.0,6.0,Cash,NaN,2023-03-30
117,TXN_2148617,Juice,NaN,3.0,9.0,Digital Wallet,UNKNOWN,2023-01-10
...,...,...,...,...,...,...,...,...
9932,TXN_8502079,Tea,NaN,1.5,3.0,Cash,NaN,2023-04-20
9935,TXN_9778251,Tea,NaN,1.5,6.0,NaN,Takeaway,2023-11-09
9944,TXN_7495283,Cake,NaN,3.0,15.0,Credit Card,Takeaway,2023-04-14
9957,TXN_6487003,Coffee,NaN,2.0,8.0,Credit Card,Takeaway,2023-11-15
9984,TXN_3142496,Smoothie,NaN,4.0,4.0,Cash,Takeaway,2023-07-27

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9175 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9175 non-null   object
 1   Item              9175 non-null   object
 2   Quantity          8749 non-null   float64
 3   Price Per Unit    9175 non-null   float64
 4   Total Spent       8723 non-null   float64
 5   Payment Method    6819 non-null   object
 6   Location          6192 non-null   object
 7   Transaction Date  9175 non-null   object
dtypes: float64(3), object(5)
memory usage: 645.1+ KB

In [64]:
df.isnull().sum()

Transaction ID         0
Item                   0
Quantity             426
Price Per Unit         0
Total Spent          452
Payment Method      2356
Location            2983
Transaction Date       0
dtype: int64

In [65]:
categorical_columns = ['Item', 'Payment Method', 'Location']
for column in categorical_columns:
    print(f"\nValue counts for '{column}':")
    print(df[column].value_counts(dropna=False))

Value counts for 'Item':
Item
Juice       1243
Coffee      1194
Smoothie    1161
Salad       1131
Cake        1122
Sandwich    1114
Cookie      1111
Tea         1099
Name: count, dtype: int64

Value counts for 'Payment Method':
Payment Method
NaN               2356
Digital Wallet    2107
Credit Card       2080
Cash              2079
ERROR              288
UNKNOWN            265
Name: count, dtype: int64

Value counts for 'Location':
Location
NaN         2983
Takeaway    2777
In-store    2775
ERROR        331
UNKNOWN      309
Name: count, dtype: int64

In [66]:
# Check data type consistency for numeric columns
numeric_columns = ['Total Spent','Payment Method', 'Location']
for column in numeric_columns:
    print(f"\nNon-numeric values in '{column}':")
    print(df[pd.to_numeric(df[column], errors='coerce').isnull()][column].unique())

Non-numeric values in 'Total Spent':
[nan]

Non-numeric values in 'Payment Method':
['Credit Card' 'Cash' 'UNKNOWN' 'Digital Wallet' nan 'ERROR']

Non-numeric values in 'Location':
['Takeaway' 'In-store' 'UNKNOWN' nan 'ERROR']

In [68]:
df.dropna(subset=['Total Spent'], inplace=False)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8723 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8723 non-null   object
 1   Item              8723 non-null   object
 2   Quantity          8317 non-null   float64
 3   Price Per Unit    8723 non-null   float64
 4   Total Spent       8723 non-null   float64
 5   Payment Method    6483 non-null   object
 6   Location          5891 non-null   object
 7   Transaction Date  8723 non-null   object
dtypes: float64(3), object(5)
memory usage: 613.3+ KB

In [70]:
df.dropna(subset=['Payment Method'], inplace=False)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6483 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    6483 non-null   object
 1   Item              6483 non-null   object
 2   Quantity          6184 non-null   float64
 3   Price Per Unit    6483 non-null   float64
 4   Total Spent       6483 non-null   float64
 5   Payment Method    6483 non-null   object
 6   Location          4388 non-null   object
 7   Transaction Date  6483 non-null   object
dtypes: float64(3), object(5)
memory usage: 455.8+ KB

In [71]:
df.dropna(subset=['Quantity'], inplace=False)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6483 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    6483 non-null   object
 1   Item              6483 non-null   object
 2   Quantity          6184 non-null   float64
 3   Price Per Unit    6483 non-null   float64
 4   Total Spent       6483 non-null   float64
 5   Payment Method    6483 non-null   object
 6   Location          4388 non-null   object
 7   Transaction Date  6483 non-null   object
dtypes: float64(3), object(5)
memory usage: 455.8+ KB

In [72]:
# Check data type consistency for numeric columns
numeric_columns = ['Quantity','Total Spent','Payment Method', 'Location']
for column in numeric_columns:
    print(f"\nNon-numeric values in '{column}':")
    print(df[pd.to_numeric(df[column], errors='coerce').isnull()][column].unique())

Non-numeric values in 'Quantity':
[nan]

Non-numeric values in 'Total Spent':
[]

Non-numeric values in 'Payment Method':
['Credit Card' 'Cash' 'UNKNOWN' 'Digital Wallet' 'ERROR']

Non-numeric values in 'Location':
['Takeaway' 'In-store' 'UNKNOWN' nan 'ERROR']

In [73]:
empty_price_df2 = df[df['Quantity'].isna()]
empty_price_df2

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
20,TXN_3522028,Smoothie,NaN,4.0,20.0,Cash,In-store,2023-04-04
55,TXN_5522862,Cookie,NaN,1.0,2.0,Credit Card,Takeaway,2023-03-19
57,TXN_2080895,Cake,NaN,3.0,3.0,Digital Wallet,In-store,2023-04-19
66,TXN_8501819,Juice,NaN,3.0,6.0,Cash,NaN,2023-03-30
117,TXN_2148617,Juice,NaN,3.0,9.0,Digital Wallet,UNKNOWN,2023-01-10
...,...,...,...,...,...,...,...,...
9896,TXN_9089045,Coffee,NaN,2.0,10.0,Cash,In-store,2023-03-12
9932,TXN_8502079,Tea,NaN,1.5,3.0,Cash,NaN,2023-04-20
9944,TXN_7495283,Cake,NaN,3.0,15.0,Credit Card,Takeaway,2023-04-14
9957,TXN_6487003,Coffee,NaN,2.0,8.0,Credit Card,Takeaway,2023-11-15
9984,TXN_3142496,Smoothie,NaN,4.0,4.0,Cash,Takeaway,2023-07-27

In [74]:
df = df[~df['Payment Method'].isin(['ERROR', 'UNKNOWN'])]
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5964 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    5964 non-null   object
 1   Item              5964 non-null   object
 2   Quantity          5693 non-null   float64
 3   Price Per Unit    5964 non-null   float64
 4   Total Spent       5964 non-null   float64
 5   Payment Method    5964 non-null   object
 6   Location          4065 non-null   object
 7   Transaction Date  5964 non-null   object
dtypes: float64(3), object(5)
memory usage: 419.3+ KB

In [75]:
df = df[~df['Location'].isin(['ERROR', 'UNKNOWN'])]
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5551 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    5551 non-null   object
 1   Item              5551 non-null   object
 2   Quantity          5298 non-null   float64
 3   Price Per Unit    5551 non-null   float64
 4   Total Spent       5551 non-null   float64
 5   Payment Method    5551 non-null   object
 6   Location          3652 non-null   object
 7   Transaction Date  5551 non-null   object
dtypes: float64(3), object(5)
memory usage: 390.3+ KB

In [76]:
# Check data type consistency for numeric columns
numeric_columns = ['Quantity','Total Spent','Payment Method', 'Location']
for column in numeric_columns:
    print(f"\nNon-numeric values in '{column}':")
    print(df[pd.to_numeric(df[column], errors='coerce').isnull()][column].unique())

Non-numeric values in 'Quantity':
[nan]

Non-numeric values in 'Total Spent':
[]

Non-numeric values in 'Payment Method':
['Credit Card' 'Cash' 'Digital Wallet']

Non-numeric values in 'Location':
['Takeaway' 'In-store' nan]

In [77]:
df.isnull().sum()

Transaction ID         0
Item                   0
Quantity             253
Price Per Unit         0
Total Spent            0
Payment Method         0
Location            1899
Transaction Date       0
dtype: int64

In [78]:
df_dropna_subset = df.dropna(subset=['Quantity', 'Location'], inplace= True)

In [80]:
df.isnull().sum()

Transaction ID      0
Item                0
Quantity            0
Price Per Unit      0
Total Spent         0
Payment Method      0
Location            0
Transaction Date    0
dtype: int64

In [81]:
df.describe()

          Quantity  Price Per Unit  Total Spent
count  3489.000000     3489.000000  3489.000000
mean      3.033247        2.939238     8.920894
std       1.416456        1.286020     6.001784
min       1.000000        1.000000     1.000000
25%       2.000000        2.000000     4.000000
50%       3.000000        3.000000     8.000000
75%       4.000000        4.000000    12.000000
max       5.000000        5.000000    25.000000

In [82]:
df.sample(10)

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
6015,TXN_8131533,Cake,1.0,3.0,3.0,Cash,In-store,2023-07-18
769,TXN_7608816,Juice,3.0,3.0,9.0,Digital Wallet,In-store,2023-11-07
4715,TXN_3842766,Tea,3.0,1.5,4.5,Credit Card,In-store,2023-03-24
1664,TXN_6992164,Sandwich,2.0,4.0,8.0,Cash,Takeaway,ERROR
1208,TXN_1741325,Tea,2.0,1.5,3.0,Credit Card,In-store,2023-03-31
3387,TXN_7208533,Tea,1.0,1.5,1.5,Cash,In-store,2023-05-15
3905,TXN_6201227,Salad,2.0,5.0,10.0,Cash,Takeaway,2023-01-15
7699,TXN_5139074,Cake,1.0,3.0,3.0,Digital Wallet,Takeaway,2023-11-16
6006,TXN_1058466,Cookie,3.0,1.0,3.0,Digital Wallet,Takeaway,2023-12-07
7316,TXN_9395223,Cookie,4.0,1.0,4.0,Credit Card,In-store,2023-12-29

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3489 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    3489 non-null   object
 1   Item              3489 non-null   object
 2   Quantity          3489 non-null   float64
 3   Price Per Unit    3489 non-null   float64
 4   Total Spent       3489 non-null   float64
 5   Payment Method    3489 non-null   object
 6   Location          3489 non-null   object
 7   Transaction Date  3489 non-null   object
dtypes: float64(3), object(5)
memory usage: 245.3+ KB

In [84]:
df.to_csv("dirty_sales_result_2.csv")